/* 3ge6 ftyp description */
"3GPP (.3GP) Release 6 MBMS Extended Presentations" = "3GPP (.3GP) Release 6 MBMS Extended Presentations";

/* 3ge7 ftyp description */
"3GPP (.3GP) Release 7 MBMS Extended Presentations" = "3GPP (.3GP) Release 7 MBMS Extended Presentations";

/* 3gp1 ftyp description */
"3GPP Media (.3GP) Release 1" = "3GPP Media (.3GP) Release 1";

/* 3gp2 ftyp description */
"3GPP Media (.3GP) Release 2" = "3GPP Media (.3GP) Release 2";

/* 3gp3 ftyp description */
"3GPP Media (.3GP) Release 3" = "3GPP Media (.3GP) Release 3";

/* 3gp4 ftyp description */
"3GPP Media (.3GP) Release 4" = "3GPP Media (.3GP) Release 4";

/* 3gp5 ftyp description */
"3GPP Media (.3GP) Release 5" = "3GPP Media (.3GP) Release 5";

/* 3gp6 ftyp description */
"3GPP Media (.3GP) Release 6 Basic Profile" = "3GPP Media (.3GP) Release 6 Basic Profile";

/* 3gs7 ftyp description */
"3GPP Media (.3GP) Release 7 Streaming Servers" = "3GPP Media (.3GP) Release 7 Streaming Servers";

/* 3gg6 ftyp description */
"3GPP Release 6 General Profile" = "3GPP Release 6 General Profile";

/* KDDI ftyp description */
"3GPP2 EZmovie for KDDI 3G cellphones" = "3GPP2 EZmovie for KDDI 3G cellphones";

/* 3g2a ftyp description */
"3GPP2 Media (.3G2) compliant with 3GPP2 C.S0050-0 V1.0" = "3GPP2 Media (.3G2) compliant with 3GPP2 C.S0050-0 V1.0";

/* 3g2b ftyp description */
"3GPP2 Media (.3G2) compliant with 3GPP2 C.S0050-A V1.0.0" = "3GPP2 Media (.3G2) compliant with 3GPP2 C.S0050-A V1.0.0";

/* 3g2c ftyp description */
"3GPP2 Media (.3G2) compliant with 3GPP2 C.S0050-B v1.0" = "3GPP2 Media (.3G2) compliant with 3GPP2 C.S0050-B v1.0";

/* M4VP ftyp description */
"Apple iPhone (.M4V)" = "Apple iPhone (.M4V)";

/* M4A  ftyp description */
"Apple iTunes AAC-LC (.M4A) Audio" = "Apple iTunes AAC-LC (.M4A) Audio";

/* M4B ftyp description */
"Apple iTunes AAC-LC (.M4B) Audio Book" = "Apple iTunes AAC-LC (.M4B) Audio Book";

/* M4P  ftyp description */
"Apple iTunes AAC-LC (.M4P) AES Protected Audio" = "Apple iTunes AAC-LC (.M4P) AES Protected Audio";

/* M4V  ftyp description */
"Apple iTunes Video (.M4V) Video" = "Apple iTunes Video (.M4V) Video";

/* qt   ftyp description */
"Apple QuickTime (.MOV/QT)" = "Apple QuickTime (.MOV/QT)";

/* M4VH ftyp description */
"Apple TV (.M4V)" = "Apple TV (.M4V)";

/* F4B  ftyp description */
"Audio Book for Adobe Flash Player 9+ (.F4B)" = "Audio Book for Adobe Flash Player 9+ (.F4B)";

/* F4A  ftyp description */
"Audio for Adobe Flash Player 9+ (.F4A)" = "Audio for Adobe Flash Player 9+ (.F4A)";

/* CAEP ftyp description */
"Canon Digital Camera" = "Canon Digital Camera";

/* caqv ftyp description */
"Casio Digital Camera" = "Casio Digital Camera";

/* CDes ftyp description */
"Convergent Design" = "Convergent Design";

/* dmpf ftyp description */
"Digital Media Project" = "Digital Media Project";

/* drc1 ftyp description */
"Dirac (wavelet compression), encapsulated in ISO base media (MP4)" = "Dirac (wavelet compression), encapsulated in ISO base media (MP4)";

/* da2a ftyp description */
"DMB MAF aud w/ HE-AAC v2 aud, MOT slides, DLS, JPG/PNG/MNG images" = "DMB MAF aud w/ HE-AAC v2 aud, MOT slides, DLS, JPG/PNG/MNG images";

/* da3a ftyp description */
"DMB MAF aud with HE-AAC aud, JPG/PNG/MNG images" = "DMB MAF aud with HE-AAC aud, JPG/PNG/MNG images";

/* da1a ftyp description */
"DMB MAF audio with ER-BSAC audio, JPG/PNG/MNG images" = "DMB MAF audio with ER-BSAC audio, JPG/PNG/MNG images";

/* dmb1 ftyp description */
"DMB MAF supporting all the components defined in the specification" = "DMB MAF supporting all the components defined in the specification";

/* dv1a ftyp description */
"DMB MAF vid w/ AVC vid, ER-BSAC aud, BIFS, JPG/PNG/MNG images, TS" = "DMB MAF vid w/ AVC vid, ER-BSAC aud, BIFS, JPG/PNG/MNG images, TS";

/* dv3a ftyp description */
"DMB MAF vid w/ AVC vid, HE-AAC aud, BIFS, JPG/PNG/MNG images, TS" = "DMB MAF vid w/ AVC vid, HE-AAC aud, BIFS, JPG/PNG/MNG images, TS";

/* dv2a ftyp description */
"DMB MAF vid w/ AVC vid, HE-AAC v2 aud, BIFS, JPG/PNG/MNG images, TS" = "DMB MAF vid w/ AVC vid, HE-AAC v2 aud, BIFS, JPG/PNG/MNG images, TS";

/* da0a ftyp description */
"DMB MAF w/ MPEG Layer II aud, MOT slides, DLS, JPG/PNG/MNG images" = "DMB MAF w/ MPEG Layer II aud, MOT slides, DLS, JPG/PNG/MNG images";

/* da0b ftyp description */
"DMB MAF, extending DA0A, with 3GPP timed text, DID, TVA, REL, IPMP" = "DMB MAF, extending DA0A, with 3GPP timed text, DID, TVA, REL, IPMP";

/* da1b ftyp description */
"DMB MAF, extending da1a, with 3GPP timed text, DID, TVA, REL, IPMP" = "DMB MAF, extending da1a, with 3GPP timed text, DID, TVA, REL, IPMP";

/* da2b ftyp description */
"DMB MAF, extending da2a, with 3GPP timed text, DID, TVA, REL, IPMP" = "DMB MAF, extending da2a, with 3GPP timed text, DID, TVA, REL, IPMP";

/* da3b ftyp description */
"DMB MAF, extending da3a w/ BIFS, 3GPP timed text, DID, TVA, REL, IPMP" = "DMB MAF, extending da3a w/ BIFS, 3GPP timed text, DID, TVA, REL, IPMP";

/* dv1b ftyp description */
"DMB MAF, extending dv1a, with 3GPP timed text, DID, TVA, REL, IPMP" = "DMB MAF, extending dv1a, with 3GPP timed text, DID, TVA, REL, IPMP";

/* dv2b ftyp description */
"DMB MAF, extending dv2a, with 3GPP timed text, DID, TVA, REL, IPMP" = "DMB MAF, extending dv2a, with 3GPP timed text, DID, TVA, REL, IPMP";

/* dv3b ftyp description */
"DMB MAF, extending dv3a, with 3GPP timed text, DID, TVA, REL, IPMP" = "DMB MAF, extending dv3a, with 3GPP timed text, DID, TVA, REL, IPMP";

/* dvt1 ftyp description */
"DVB (.DVB) over MPEG-2 Transport Stream" = "DVB (.DVB) over MPEG-2 Transport Stream";

/* dvr1 ftyp description */
"DVB (.DVB) over RTP" = "DVB (.DVB) over RTP";

/* NDXC ftyp description */
"H.264/MPEG-4 AVC (.MP4) Nero Cinema Profile" = "H.264/MPEG-4 AVC (.MP4) Nero Cinema Profile";

/* NDXH ftyp description */
"H.264/MPEG-4 AVC (.MP4) Nero HDTV Profile" = "H.264/MPEG-4 AVC (.MP4) Nero HDTV Profile";

/* NDXM ftyp description */
"H.264/MPEG-4 AVC (.MP4) Nero Mobile Profile" = "H.264/MPEG-4 AVC (.MP4) Nero Mobile Profile";

/* NDXP ftyp description */
"H.264/MPEG-4 AVC (.MP4) Nero Portable Profile" = "H.264/MPEG-4 AVC (.MP4) Nero Portable Profile";

/* NDXS ftyp description */
"H.264/MPEG-4 AVC (.MP4) Nero Standard Profile" = "H.264/MPEG-4 AVC (.MP4) Nero Standard Profile";

/* isc2 ftyp description */
"ISMACryp 2.0 Encrypted File" = "ISMACryp 2.0 Encrypted File";

/* jpm  ftyp description */
"JPEG 2000 Compound Image (.JPM) [ISO 15444-6]" = "JPEG 2000 Compound Image (.JPM) [ISO 15444-6]";

/* JP2  ftyp description */
"JPEG 2000 Image (.JP2) [ISO 15444-1 ?]" = "JPEG 2000 Image (.JP2) [ISO 15444-1 ?]";

/* jpx  ftyp description */
"JPEG 2000 w/ extensions (.JPX) [ISO 15444-2]" = "JPEG 2000 w/ extensions (.JPX) [ISO 15444-2]";

/* mj2p ftyp description */
"Motion JPEG 2000 [ISO 15444-3] General Profile" = "Motion JPEG 2000 [ISO 15444-3] General Profile";

/* mj2s ftyp description */
"Motion JPEG 2000 [ISO 15444-3] Simple Profile" = "Motion JPEG 2000 [ISO 15444-3] Simple Profile";

/* isom ftyp description */
"MP4  Base Media v1 [IS0 14496-12:2003]" = "MP4  Base Media v1 [IS0 14496-12:2003]";

/* iso2 ftyp description */
"MP4 Base Media v2 [ISO 14496-12:2005]" = "MP4 Base Media v2 [ISO 14496-12:2005]";

/* avc1 ftyp description */
"MP4 Base w/ AVC ext [ISO 14496-12:2005]" = "MP4 Base w/ AVC ext [ISO 14496-12:2005]";

/* mp41 ftyp description */
"MP4 v1 [ISO 14496-1:ch13]" = "MP4 v1 [ISO 14496-1:ch13]";

/* mp42 ftyp description */
"MP4 v2 [ISO 14496-14]" = "MP4 v2 [ISO 14496-14]";

/* NDAS ftyp description */
"MP4 v2 [ISO 14496-14] Nero Digital AAC Audio" = "MP4 v2 [ISO 14496-14] Nero Digital AAC Audio";

/* mp71 ftyp description */
"MP4 w/ MPEG-7 Metadata [per ISO 14496-12]" = "MP4 w/ MPEG-7 Metadata [per ISO 14496-12]";

/* mp21 ftyp description */
"MPEG-21 [ISO/IEC 21000-9]" = "MPEG-21 [ISO/IEC 21000-9]";

/* MSNV ftyp description */
"MPEG-4 (.MP4) for SonyPSP" = "MPEG-4 (.MP4) for SonyPSP";

/* NDSC ftyp description */
"MPEG-4 (.MP4) Nero Cinema Profile" = "MPEG-4 (.MP4) Nero Cinema Profile";

/* NDSH ftyp description */
"MPEG-4 (.MP4) Nero HDTV Profile" = "MPEG-4 (.MP4) Nero HDTV Profile";

/* NDSM ftyp description */
"MPEG-4 (.MP4) Nero Mobile Profile" = "MPEG-4 (.MP4) Nero Mobile Profile";

/* NDSP ftyp description */
"MPEG-4 (.MP4) Nero Portable Profile" = "MPEG-4 (.MP4) Nero Portable Profile";

/* NDSS ftyp description */
"MPEG-4 (.MP4) Nero Standard Profile" = "MPEG-4 (.MP4) Nero Standard Profile";

/* mmp4 ftyp description */
"MPEG-4/3GPP Mobile Profile (.MP4 / .3GP) (for NTT)" = "MPEG-4/3GPP Mobile Profile (.MP4 / .3GP) (for NTT)";

/* odcf ftyp description */
"OMA DCF DRM Format 2.0 (OMA-TS-DRM-DCF-V2_0-20060303-A)" = "OMA DCF DRM Format 2.0 (OMA-TS-DRM-DCF-V2_0-20060303-A)";

/* opx2 ftyp description */
"OMA PDCF DRM + XBS extensions (OMA-TS-DRM_XBS-V1_0-20070529-C)" = "OMA PDCF DRM + XBS extensions (OMA-TS-DRM_XBS-V1_0-20070529-C)";

/* opf2 ftyp description */
"OMA PDCF DRM Format 2.1 (OMA-TS-DRM-DCF-V2_1-20070724-C)" = "OMA PDCF DRM Format 2.1 (OMA-TS-DRM-DCF-V2_1-20070724-C)";

/* pana ftyp description */
"Panasonic Digital Camera" = "Panasonic Digital Camera";

/* MPPI ftyp description */
"Photo Player, MAF [ISO/IEC 23000-3]" = "Photo Player, MAF [ISO/IEC 23000-3]";

/* F4P  ftyp description */
"Protected Video for Adobe Flash Player 9+ (.F4P)" = "Protected Video for Adobe Flash Player 9+ (.F4P)";

/* ROSS ftyp description */
"Ross Video" = "Ross Video";

/* ssc2 ftyp description */
"Samsung stereoscopic, dual stream" = "Samsung stereoscopic, dual stream";

/* ssc1 ftyp description */
"Samsung stereoscopic, single stream" = "Samsung stereoscopic, single stream";

/* sdv  ftyp description */
"SD Memory Card Video" = "SD Memory Card Video";

/* mqt  ftyp description */
"Sony / Mobile QuickTime (.MQV)  US Patent 7,477,830 (Sony Corp)" = "Sony / Mobile QuickTime (.MQV)  US Patent 7,477,830 (Sony Corp)";

/* JP20 ftyp description */
"Unknown, from GPAC samples" = "Unknown, from GPAC samples";

/* F4V  ftyp description */
"Video for Adobe Flash Player 9+ (.F4V)" = "Video for Adobe Flash Player 9+ (.F4V)";

